codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024eff100.h
  .extern C2RXF30SET       /* 0xBF881328 */
  .extern C2RXF30INV       /* 0xBF88132C */
  .extern C2RXF31          /* 0xBF881330 */
  .extern C2RXF31CLR       /* 0xBF881334 */
  .extern C2RXF31SET       /* 0xBF881338 */
  .extern C2RXF31INV       /* 0xBF88133C */
  .extern C2FIFOBA         /* 0xBF881340 */
  .extern C2FIFOBACLR      /* 0xBF881344 */
  .extern C2FIFOBASET      /* 0xBF881348 */
  .extern C2FIFOBAINV      /* 0xBF88134C */
  .extern C2FIFOCON0       /* 0xBF881350 */
  .extern C2FIFOCON0CLR    /* 0xBF881354 */
  .extern C2FIFOCON0SET    /* 0xBF881358 */
  .extern C2FIFOCON0INV    /* 0xBF88135C */
  .extern C2FIFOINT0       /* 0xBF881360 */
  .extern C2FIFOINT0CLR    /* 0xBF881364 */
  .extern C2FIFOINT0SET    /* 0xBF881368 */
  .extern C2FIFOINT0INV    /* 0xBF88136C */
  .extern C2FIFOUA0        /* 0xBF881370 */
  .extern C2FIFOUA0CLR     /* 0xBF881374 */
  .extern C2FIFOUA0SET     /* 0xBF881378 */
  .extern C2FIFOUA0INV     /* 0xBF88137C */
  .extern C2FIFOCI0        /* 0xBF881380 */
  .extern C2FIFOCI0CLR     /* 0xBF881384 */
  .extern C2FIFOCI0SET     /* 0xBF881388 */
  .extern C2FIFOCI0INV     /* 0xBF88138C */
  .extern C2FIFOCON1       /* 0xBF881390 */
  .extern C2FIFOCON1CLR    /* 0xBF881394 */
  .extern C2FIFOCON1SET    /* 0xBF881398 */
  .extern C2FIFOCON1INV    /* 0xBF88139C */
  .extern C2FIFOINT1       /* 0xBF8813A0 */
  .extern C2FIFOINT1CLR    /* 0xBF8813A4 */
  .extern C2FIFOINT1SET    /* 0xBF8813A8 */
  .extern C2FIFOINT1INV    /* 0xBF8813AC */
  .extern C2FIFOUA1        /* 0xBF8813B0 */
  .extern C2FIFOUA1CLR     /* 0xBF8813B4 */
  .extern C2FIFOUA1SET     /* 0xBF8813B8 */
  .extern C2FIFOUA1INV     /* 0xBF8813BC */
  .extern C2FIFOCI1        /* 0xBF8813C0 */
  .extern C2FIFOCI1CLR     /* 0xBF8813C4 */
  .extern C2FIFOCI1SET     /* 0xBF8813C8 */
  .extern C2FIFOCI1INV     /* 0xBF8813CC */
  .extern C2FIFOCON2       /* 0xBF8813D0 */
  .extern C2FIFOCON2CLR    /* 0xBF8813D4 */
  .extern C2FIFOCON2SET    /* 0xBF8813D8 */
  .extern C2FIFOCON2INV    /* 0xBF8813DC */
  .extern C2FIFOINT2       /* 0xBF8813E0 */
  .extern C2FIFOINT2CLR    /* 0xBF8813E4 */
  .extern C2FIFOINT2SET    /* 0xBF8813E8 */
  .extern C2FIFOINT2INV    /* 0xBF8813EC */
  .extern C2FIFOUA2        /* 0xBF8813F0 */
  .extern C2FIFOUA2CLR     /* 0xBF8813F4 */
  .extern C2FIFOUA2SET     /* 0xBF8813F8 */
  .extern C2FIFOUA2INV     /* 0xBF8813FC */
  .extern C2FIFOCI2        /* 0xBF881400 */
  .extern C2FIFOCI2CLR     /* 0xBF881404 */
  .extern C2FIFOCI2SET     /* 0xBF881408 */
  .extern C2FIFOCI2INV     /* 0xBF88140C */
  .extern C2FIFOCON3       /* 0xBF881410 */
  .extern C2FIFOCON3CLR    /* 0xBF881414 */
  .extern C2FIFOCON3SET    /* 0xBF881418 */
  .extern C2FIFOCON3INV    /* 0xBF88141C */
  .extern C2FIFOINT3       /* 0xBF881420 */
  .extern C2FIFOINT3CLR    /* 0xBF881424 */
  .extern C2FIFOINT3SET    /* 0xBF881428 */
  .extern C2FIFOINT3INV    /* 0xBF88142C */
  .extern C2FIFOUA3        /* 0xBF881430 */
  .extern C2FIFOUA3CLR     /* 0xBF881434 */
  .extern C2FIFOUA3SET     /* 0xBF881438 */
  .extern C2FIFOUA3INV     /* 0xBF88143C */
  .extern C2FIFOCI3        /* 0xBF881440 */
  .extern C2FIFOCI3CLR     /* 0xBF881444 */
  .extern C2FIFOCI3SET     /* 0xBF881448 */
  .extern C2FIFOCI3INV     /* 0xBF88144C */
  .extern C2FIFOCON4       /* 0xBF881450 */
  .extern C2FIFOCON4CLR    /* 0xBF881454 */
  .extern C2FIFOCON4SET    /* 0xBF881458 */
  .extern C2FIFOCON4INV    /* 0xBF88145C */
  .extern C2FIFOINT4       /* 0xBF881460 */
  .extern C2FIFOINT4CLR    /* 0xBF881464 */
  .extern C2FIFOINT4SET    /* 0xBF881468 */
  .extern C2FIFOINT4INV    /* 0xBF88146C */
  .extern C2FIFOUA4        /* 0xBF881470 */
  .extern C2FIFOUA4CLR     /* 0xBF881474 */
  .extern C2FIFOUA4SET     /* 0xBF881478 */
  .extern C2FIFOUA4INV     /* 0xBF88147C */
  .extern C2FIFOCI4        /* 0xBF881480 */
  .extern C2FIFOCI4CLR     /* 0xBF881484 */
  .extern C2FIFOCI4SET     /* 0xBF881488 */
  .extern C2FIFOCI4INV     /* 0xBF88148C */
  .extern C2FIFOCON5       /* 0xBF881490 */
  .extern C2FIFOCON5CLR    /* 0xBF881494 */
  .extern C2FIFOCON5SET    /* 0xBF881498 */
  .extern C2FIFOCON5INV    /* 0xBF88149C */
  .extern C2FIFOINT5       /* 0xBF8814A0 */
  .extern C2FIFOINT5CLR    /* 0xBF8814A4 */
  .extern C2FIFOINT5SET    /* 0xBF8814A8 */
  .extern C2FIFOINT5INV    /* 0xBF8814AC */
  .extern C2FIFOUA5        /* 0xBF8814B0 */
  .extern C2FIFOUA5CLR     /* 0xBF8814B4 */
  .extern C2FIFOUA5SET     /* 0xBF8814B8 */
  .extern C2FIFOUA5INV     /* 0xBF8814BC */
  .extern C2FIFOCI5        /* 0xBF8814C0 */
  .extern C2FIFOCI5CLR     /* 0xBF8814C4 */
  .extern C2FIFOCI5SET     /* 0xBF8814C8 */
  .extern C2FIFOCI5INV     /* 0xBF8814CC */
  .extern C2FIFOCON6       /* 0xBF8814D0 */
  .extern C2FIFOCON6CLR    /* 0xBF8814D4 */
  .extern C2FIFOCON6SET    /* 0xBF8814D8 */
  .extern C2FIFOCON6INV    /* 0xBF8814DC */
  .extern C2FIFOINT6       /* 0xBF8814E0 */
  .extern C2FIFOINT6CLR    /* 0xBF8814E4 */
  .extern C2FIFOINT6SET    /* 0xBF8814E8 */
  .extern C2FIFOINT6INV    /* 0xBF8814EC */
  .extern C2FIFOUA6        /* 0xBF8814F0 */
  .extern C2FIFOUA6CLR     /* 0xBF8814F4 */
  .extern C2FIFOUA6SET     /* 0xBF8814F8 */
  .extern C2FIFOUA6INV     /* 0xBF8814FC */
  .extern C2FIFOCI6        /* 0xBF881500 */
  .extern C2FIFOCI6CLR     /* 0xBF881504 */
  .extern C2FIFOCI6SET     /* 0xBF881508 */
  .extern C2FIFOCI6INV     /* 0xBF88150C */
  .extern C2FIFOCON7       /* 0xBF881510 */
  .extern C2FIFOCON7CLR    /* 0xBF881514 */
  .extern C2FIFOCON7SET    /* 0xBF881518 */
  .extern C2FIFOCON7INV    /* 0xBF88151C */
  .extern C2FIFOINT7       /* 0xBF881520 */
  .extern C2FIFOINT7CLR    /* 0xBF881524 */
  .extern C2FIFOINT7SET    /* 0xBF881528 */
  .extern C2FIFOINT7INV    /* 0xBF88152C */
  .extern C2FIFOUA7        /* 0xBF881530 */
  .extern C2FIFOUA7CLR     /* 0xBF881534 */
  .extern C2FIFOUA7SET     /* 0xBF881538 */
  .extern C2FIFOUA7INV     /* 0xBF88153C */
  .extern C2FIFOCI7        /* 0xBF881540 */
  .extern C2FIFOCI7CLR     /* 0xBF881544 */
  .extern C2FIFOCI7SET     /* 0xBF881548 */
  .extern C2FIFOCI7INV     /* 0xBF88154C */
  .extern C2FIFOCON8       /* 0xBF881550 */
  .extern C2FIFOCON8CLR    /* 0xBF881554 */
  .extern C2FIFOCON8SET    /* 0xBF881558 */
  .extern C2FIFOCON8INV    /* 0xBF88155C */
  .extern C2FIFOINT8       /* 0xBF881560 */
  .extern C2FIFOINT8CLR    /* 0xBF881564 */
  .extern C2FIFOINT8SET    /* 0xBF881568 */
  .extern C2FIFOINT8INV    /* 0xBF88156C */
  .extern C2FIFOUA8        /* 0xBF881570 */
  .extern C2FIFOUA8CLR     /* 0xBF881574 */
  .extern C2FIFOUA8SET     /* 0xBF881578 */
  .extern C2FIFOUA8INV     /* 0xBF88157C */
  .extern C2FIFOCI8        /* 0xBF881580 */
  .extern C2FIFOCI8CLR     /* 0xBF881584 */
  .extern C2FIFOCI8SET     /* 0xBF881588 */
  .extern C2FIFOCI8INV     /* 0xBF88158C */
  .extern C2FIFOCON9       /* 0xBF881590 */
  .extern C2FIFOCON9CLR    /* 0xBF881594 */
  .extern C2FIFOCON9SET    /* 0xBF881598 */
  .extern C2FIFOCON9INV    /* 0xBF88159C */
  .extern C2FIFOINT9       /* 0xBF8815A0 */
  .extern C2FIFOINT9CLR    /* 0xBF8815A4 */
  .extern C2FIFOINT9SET    /* 0xBF8815A8 */
  .extern C2FIFOINT9INV    /* 0xBF8815AC */
  .extern C2FIFOUA9        /* 0xBF8815B0 */
  .extern C2FIFOUA9CLR     /* 0xBF8815B4 */
  .extern C2FIFOUA9SET     /* 0xBF8815B8 */
  .extern C2FIFOUA9INV     /* 0xBF8815BC */
  .extern C2FIFOCI9        /* 0xBF8815C0 */
  .extern C2FIFOCI9CLR     /* 0xBF8815C4 */
  .extern C2FIFOCI9SET     /* 0xBF8815C8 */
  .extern C2FIFOCI9INV     /* 0xBF8815CC */
  .extern C2FIFOCON10      /* 0xBF8815D0 */
  .extern C2FIFOCON10CLR   /* 0xBF8815D4 */
  .extern C2FIFOCON10SET   /* 0xBF8815D8 */
  .extern C2FIFOCON10INV   /* 0xBF8815DC */
  .extern C2FIFOINT10      /* 0xBF8815E0 */
  .extern C2FIFOINT10CLR   /* 0xBF8815E4 */
  .extern C2FIFOINT10SET   /* 0xBF8815E8 */
  .extern C2FIFOINT10INV   /* 0xBF8815EC */
  .extern C2FIFOUA10       /* 0xBF8815F0 */
  .extern C2FIFOUA10CLR    /* 0xBF8815F4 */
  .extern C2FIFOUA10SET    /* 0xBF8815F8 */
  .extern C2FIFOUA10INV    /* 0xBF8815FC */
  .extern C2FIFOCI10       /* 0xBF881600 */
  .extern C2FIFOCI10CLR    /* 0xBF881604 */
  .extern C2FIFOCI10SET    /* 0xBF881608 */
  .extern C2FIFOCI10INV    /* 0xBF88160C */
  .extern C2FIFOCON11      /* 0xBF881610 */
  .extern C2FIFOCON11CLR   /* 0xBF881614 */
  .extern C2FIFOCON11SET   /* 0xBF881618 */
  .extern C2FIFOCON11INV   /* 0xBF88161C */
  .extern C2FIFOINT11      /* 0xBF881620 */
  .extern C2FIFOINT11CLR   /* 0xBF881624 */
  .extern C2FIFOINT11SET   /* 0xBF881628 */
  .extern C2FIFOINT11INV   /* 0xBF88162C */
  .extern C2FIFOUA11       /* 0xBF881630 */
  .extern C2FIFOUA11CLR    /* 0xBF881634 */
  .extern C2FIFOUA11SET    /* 0xBF881638 */
  .extern C2FIFOUA11INV    /* 0xBF88163C */
  .extern C2FIFOCI11       /* 0xBF881640 */
  .extern C2FIFOCI11CLR    /* 0xBF881644 */
  .extern C2FIFOCI11SET    /* 0xBF881648 */
  .extern C2FIFOCI11INV    /* 0xBF88164C */
  .extern C2FIFOCON12      /* 0xBF881650 */
  .extern C2FIFOCON12CLR   /* 0xBF881654 */
  .extern C2FIFOCON12SET   /* 0xBF881658 */
  .extern C2FIFOCON12INV   /* 0xBF88165C */
  .extern C2FIFOINT12      /* 0xBF881660 */
  .extern C2FIFOINT12CLR   /* 0xBF881664 */
  .extern C2FIFOINT12SET   /* 0xBF881668 */
  .extern C2FIFOINT12INV   /* 0xBF88166C */
  .extern C2FIFOUA12       /* 0xBF881670 */
  .extern C2FIFOUA12CLR    /* 0xBF881674 */
  .extern C2FIFOUA12SET    /* 0xBF881678 */
  .extern C2FIFOUA12INV    /* 0xBF88167C */
  .extern C2FIFOCI12       /* 0xBF881680 */
  .extern C2FIFOCI12CLR    /* 0xBF881684 */
  .extern C2FIFOCI12SET    /* 0xBF881688 */
  .extern C2FIFOCI12INV    /* 0xBF88168C */
  .extern C2FIFOCON13      /* 0xBF881690 */
  .extern C2FIFOCON13CLR   /* 0xBF881694 */
  .extern C2FIFOCON13SET   /* 0xBF881698 */
  .extern C2FIFOCON13INV   /* 0xBF88169C */
  .extern C2FIFOINT13      /* 0xBF8816A0 */
  .extern C2FIFOINT13CLR   /* 0xBF8816A4 */
  .extern C2FIFOINT13SET   /* 0xBF8816A8 */
  .extern C2FIFOINT13INV   /* 0xBF8816AC */
  .extern C2FIFOUA13       /* 0xBF8816B0 */
  .extern C2FIFOUA13CLR    /* 0xBF8816B4 */
  .extern C2FIFOUA13SET    /* 0xBF8816B8 */
  .extern C2FIFOUA13INV    /* 0xBF8816BC */
  .extern C2FIFOCI13       /* 0xBF8816C0 */
  .extern C2FIFOCI13CLR    /* 0xBF8816C4 */
  .extern C2FIFOCI13SET    /* 0xBF8816C8 */
  .extern C2FIFOCI13INV    /* 0xBF8816CC */
  .extern C2FIFOCON14      /* 0xBF8816D0 */
  .extern C2FIFOCON14CLR   /* 0xBF8816D4 */
  .extern C2FIFOCON14SET   /* 0xBF8816D8 */
  .extern C2FIFOCON14INV   /* 0xBF8816DC */
  .extern C2FIFOINT14      /* 0xBF8816E0 */
  .extern C2FIFOINT14CLR   /* 0xBF8816E4 */
  .extern C2FIFOINT14SET   /* 0xBF8816E8 */
  .extern C2FIFOINT14INV   /* 0xBF8816EC */
  .extern C2FIFOUA14       /* 0xBF8816F0 */
  .extern C2FIFOUA14CLR    /* 0xBF8816F4 */
  .extern C2FIFOUA14SET    /* 0xBF8816F8 */
  .extern C2FIFOUA14INV    /* 0xBF8816FC */
  .extern C2FIFOCI14       /* 0xBF881700 */
  .extern C2FIFOCI14CLR    /* 0xBF881704 */
  .extern C2FIFOCI14SET    /* 0xBF881708 */
  .extern C2FIFOCI14INV    /* 0xBF88170C */
  .extern C2FIFOCON15      /* 0xBF881710 */
  .extern C2FIFOCON15CLR   /* 0xBF881714 */
  .extern C2FIFOCON15SET   /* 0xBF881718 */
  .extern C2FIFOCON15INV   /* 0xBF88171C */
  .extern C2FIFOINT15      /* 0xBF881720 */
  .extern C2FIFOINT15CLR   /* 0xBF881724 */
  .extern C2FIFOINT15SET   /* 0xBF881728 */
  .extern C2FIFOINT15INV   /* 0xBF88172C */
  .extern C2FIFOUA15       /* 0xBF881730 */
  .extern C2FIFOUA15CLR    /* 0xBF881734 */
  .extern C2FIFOUA15SET    /* 0xBF881738 */
  .extern C2FIFOUA15INV    /* 0xBF88173C */
  .extern C2FIFOCI15       /* 0xBF881740 */
  .extern C2FIFOCI15CLR    /* 0xBF881744 */
  .extern C2FIFOCI15SET    /* 0xBF881748 */
  .extern C2FIFOCI15INV    /* 0xBF88174C */
  .extern C2FIFOCON16      /* 0xBF881750 */
  .extern C2FIFOCON16CLR   /* 0xBF881754 */
  .extern C2FIFOCON16SET   /* 0xBF881758 */
  .extern C2FIFOCON16INV   /* 0xBF88175C */
  .extern C2FIFOINT16      /* 0xBF881760 */
  .extern C2FIFOINT16CLR   /* 0xBF881764 */
  .extern C2FIFOINT16SET   /* 0xBF881768 */
  .extern C2FIFOINT16INV   /* 0xBF88176C */
  .extern C2FIFOUA16       /* 0xBF881770 */
  .extern C2FIFOUA16CLR    /* 0xBF881774 */
  .extern C2FIFOUA16SET    /* 0xBF881778 */
  .extern C2FIFOUA16INV    /* 0xBF88177C */
  .extern C2FIFOCI16       /* 0xBF881780 */
  .extern C2FIFOCI16CLR    /* 0xBF881784 */
  .extern C2FIFOCI16SET    /* 0xBF881788 */
  .extern C2FIFOCI16INV    /* 0xBF88178C */
  .extern C2FIFOCON17      /* 0xBF881790 */
  .extern C2FIFOCON17CLR   /* 0xBF881794 */
  .extern C2FIFOCON17SET   /* 0xBF881798 */
  .extern C2FIFOCON17INV   /* 0xBF88179C */
  .extern C2FIFOINT17      /* 0xBF8817A0 */
  .extern C2FIFOINT17CLR   /* 0xBF8817A4 */
  .extern C2FIFOINT17SET   /* 0xBF8817A8 */
  .extern C2FIFOINT17INV   /* 0xBF8817AC */
  .extern C2FIFOUA17       /* 0xBF8817B0 */
  .extern C2FIFOUA17CLR    /* 0xBF8817B4 */
  .extern C2FIFOUA17SET    /* 0xBF8817B8 */
  .extern C2FIFOUA17INV    /* 0xBF8817BC */
  .extern C2FIFOCI17       /* 0xBF8817C0 */
  .extern C2FIFOCI17CLR    /* 0xBF8817C4 */
  .extern C2FIFOCI17SET    /* 0xBF8817C8 */
  .extern C2FIFOCI17INV    /* 0xBF8817CC */
  .extern C2FIFOCON18      /* 0xBF8817D0 */
  .extern C2FIFOCON18CLR   /* 0xBF8817D4 */
  .extern C2FIFOCON18SET   /* 0xBF8817D8 */
  .extern C2FIFOCON18INV   /* 0xBF8817DC */
  .extern C2FIFOINT18      /* 0xBF8817E0 */
  .extern C2FIFOINT18CLR   /* 0xBF8817E4 */
  .extern C2FIFOINT18SET   /* 0xBF8817E8 */
  .extern C2FIFOINT18INV   /* 0xBF8817EC */
  .extern C2FIFOUA18       /* 0xBF8817F0 */
  .extern C2FIFOUA18CLR    /* 0xBF8817F4 */
  .extern C2FIFOUA18SET    /* 0xBF8817F8 */
  .extern C2FIFOUA18INV    /* 0xBF8817FC */
  .extern C2FIFOCI18       /* 0xBF881800 */
  .extern C2FIFOCI18CLR    /* 0xBF881804 */
  .extern C2FIFOCI18SET    /* 0xBF881808 */
  .extern C2FIFOCI18INV    /* 0xBF88180C */
  .extern C2FIFOCON19      /* 0xBF881810 */
  .extern C2FIFOCON19CLR   /* 0xBF881814 */
  .extern C2FIFOCON19SET   /* 0xBF881818 */
  .extern C2FIFOCON19INV   /* 0xBF88181C */
  .extern C2FIFOINT19      /* 0xBF881820 */
  .extern C2FIFOINT19CLR   /* 0xBF881824 */
  .extern C2FIFOINT19SET   /* 0xBF881828 */
  .extern C2FIFOINT19INV   /* 0xBF88182C */
  .extern C2FIFOUA19       /* 0xBF881830 */
  .extern C2FIFOUA19CLR    /* 0xBF881834 */
  .extern C2FIFOUA19SET    /* 0xBF881838 */
  .extern C2FIFOUA19INV    /* 0xBF88183C */
  .extern C2FIFOCI19       /* 0xBF881840 */
  .extern C2FIFOCI19CLR    /* 0xBF881844 */
  .extern C2FIFOCI19SET    /* 0xBF881848 */
  .extern C2FIFOCI19INV    /* 0xBF88184C */
  .extern C2FIFOCON20      /* 0xBF881850 */
  .extern C2FIFOCON20CLR   /* 0xBF881854 */
  .extern C2FIFOCON20SET   /* 0xBF881858 */
  .extern C2FIFOCON20INV   /* 0xBF88185C */
  .extern C2FIFOINT20      /* 0xBF881860 */
  .extern C2FIFOINT20CLR   /* 0xBF881864 */
  .extern C2FIFOINT20SET   /* 0xBF881868 */
  .extern C2FIFOINT20INV   /* 0xBF88186C */
  .extern C2FIFOUA20       /* 0xBF881870 */
  .extern C2FIFOUA20CLR    /* 0xBF881874 */
  .extern C2FIFOUA20SET    /* 0xBF881878 */
  .extern C2FIFOUA20INV    /* 0xBF88187C */
  .extern C2FIFOCI20       /* 0xBF881880 */
  .extern C2FIFOCI20CLR    /* 0xBF881884 */
  .extern C2FIFOCI20SET    /* 0xBF881888 */
  .extern C2FIFOCI20INV    /* 0xBF88188C */
  .extern C2FIFOCON21      /* 0xBF881890 */
  .extern C2FIFOCON21CLR   /* 0xBF881894 */
  .extern C2FIFOCON21SET   /* 0xBF881898 */
  .extern C2FIFOCON21INV   /* 0xBF88189C */
  .extern C2FIFOINT21      /* 0xBF8818A0 */
  .extern C2FIFOINT21CLR   /* 0xBF8818A4 */
  .extern C2FIFOINT21SET   /* 0xBF8818A8 */
  .extern C2FIFOINT21INV   /* 0xBF8818AC */
  .extern C2FIFOUA21       /* 0xBF8818B0 */
  .extern C2FIFOUA21CLR    /* 0xBF8818B4 */
  .extern C2FIFOUA21SET    /* 0xBF8818B8 */
  .extern C2FIFOUA21INV    /* 0xBF8818BC */
  .extern C2FIFOCI21       /* 0xBF8818C0 */
  .extern C2FIFOCI21CLR    /* 0xBF8818C4 */
  .extern C2FIFOCI21SET    /* 0xBF8818C8 */
  .extern C2FIFOCI21INV    /* 0xBF8818CC */
  .extern C2FIFOCON22      /* 0xBF8818D0 */
  .extern C2FIFOCON22CLR   /* 0xBF8818D4 */
  .extern C2FIFOCON22SET   /* 0xBF8818D8 */
  .extern C2FIFOCON22INV   /* 0xBF8818DC */
  .extern C2FIFOINT22      /* 0xBF8818E0 */
  .extern C2FIFOINT22CLR   /* 0xBF8818E4 */
  .extern C2FIFOINT22SET   /* 0xBF8818E8 */
  .extern C2FIFOINT22INV   /* 0xBF8818EC */
  .extern C2FIFOUA22       /* 0xBF8818F0 */
  .extern C2FIFOUA22CLR    /* 0xBF8818F4 */
  .extern C2FIFOUA22SET    /* 0xBF8818F8 */
  .extern C2FIFOUA22INV    /* 0xBF8818FC */
  .extern C2FIFOCI22       /* 0xBF881900 */
  .extern C2FIFOCI22CLR    /* 0xBF881904 */
  .extern C2FIFOCI22SET    /* 0xBF881908 */
  .extern C2FIFOCI22INV    /* 0xBF88190C */
  .extern C2FIFOCON23      /* 0xBF881910 */
  .extern C2FIFOCON23CLR   /* 0xBF881914 */
  .extern C2FIFOCON23SET   /* 0xBF881918 */
  .extern C2FIFOCON23INV   /* 0xBF88191C */
  .extern C2FIFOINT23      /* 0xBF881920 */
  .extern C2FIFOINT23CLR   /* 0xBF881924 */
  .extern C2FIFOINT23SET   /* 0xBF881928 */
  .extern C2FIFOINT23INV   /* 0xBF88192C */
  .extern C2FIFOUA23       /* 0xBF881930 */
  .extern C2FIFOUA23CLR    /* 0xBF881934 */
  .extern C2FIFOUA23SET    /* 0xBF881938 */
  .extern C2FIFOUA23INV    /* 0xBF88193C */
  .extern C2FIFOCI23       /* 0xBF881940 */
  .extern C2FIFOCI23CLR    /* 0xBF881944 */
  .extern C2FIFOCI23SET    /* 0xBF881948 */
  .extern C2FIFOCI23INV    /* 0xBF88194C */
  .extern C2FIFOCON24      /* 0xBF881950 */
  .extern C2FIFOCON24CLR   /* 0xBF881954 */
  .extern C2FIFOCON24SET   /* 0xBF881958 */
  .extern C2FIFOCON24INV   /* 0xBF88195C */
  .extern C2FIFOINT24      /* 0xBF881960 */
  .extern C2FIFOINT24CLR   /* 0xBF881964 */
  .extern C2FIFOINT24SET   /* 0xBF881968 */
  .extern C2FIFOINT24INV   /* 0xBF88196C */
  .extern C2FIFOUA24       /* 0xBF881970 */
  .extern C2FIFOUA24CLR    /* 0xBF881974 */
  .extern C2FIFOUA24SET    /* 0xBF881978 */
  .extern C2FIFOUA24INV    /* 0xBF88197C */
  .extern C2FIFOCI24       /* 0xBF881980 */
  .extern C2FIFOCI24CLR    /* 0xBF881984 */
  .extern C2FIFOCI24SET    /* 0xBF881988 */
  .extern C2FIFOCI24INV    /* 0xBF88198C */
  .extern C2FIFOCON25      /* 0xBF881990 */
  .extern C2FIFOCON25CLR   /* 0xBF881994 */
  .extern C2FIFOCON25SET   /* 0xBF881998 */
  .extern C2FIFOCON25INV   /* 0xBF88199C */
  .extern C2FIFOINT25      /* 0xBF8819A0 */
  .extern C2FIFOINT25CLR   /* 0xBF8819A4 */
  .extern C2FIFOINT25SET   /* 0xBF8819A8 */
  .extern C2FIFOINT25INV   /* 0xBF8819AC */
  .extern C2FIFOUA25       /* 0xBF8819B0 */
  .extern C2FIFOUA25CLR    /* 0xBF8819B4 */
  .extern C2FIFOUA25SET    /* 0xBF8819B8 */
  .extern C2FIFOUA25INV    /* 0xBF8819BC */
  .extern C2FIFOCI25       /* 0xBF8819C0 */
  .extern C2FIFOCI25CLR    /* 0xBF8819C4 */
  .extern C2FIFOCI25SET    /* 0xBF8819C8 */
  .extern C2FIFOCI25INV    /* 0xBF8819CC */
  .extern C2FIFOCON26      /* 0xBF8819D0 */
  .extern C2FIFOCON26CLR   /* 0xBF8819D4 */
  .extern C2FIFOCON26SET   /* 0xBF8819D8 */
  .extern C2FIFOCON26INV   /* 0xBF8819DC */
  .extern C2FIFOINT26      /* 0xBF8819E0 */
  .extern C2FIFOINT26CLR   /* 0xBF8819E4 */
  .extern C2FIFOINT26SET   /* 0xBF8819E8 */
  .extern C2FIFOINT26INV   /* 0xBF8819EC */
  .extern C2FIFOUA26       /* 0xBF8819F0 */
  .extern C2FIFOUA26CLR    /* 0xBF8819F4 */
  .extern C2FIFOUA26SET    /* 0xBF8819F8 */
  .extern C2FIFOUA26INV    /* 0xBF8819FC */
  .extern C2FIFOCI26       /* 0xBF881A00 */
  .extern C2FIFOCI26CLR    /* 0xBF881A04 */
  .extern C2FIFOCI26SET    /* 0xBF881A08 */
  .extern C2FIFOCI26INV    /* 0xBF881A0C */
  .extern C2FIFOCON27      /* 0xBF881A10 */
  .extern C2FIFOCON27CLR   /* 0xBF881A14 */
  .extern C2FIFOCON27SET   /* 0xBF881A18 */
  .extern C2FIFOCON27INV   /* 0xBF881A1C */
  .extern C2FIFOINT27      /* 0xBF881A20 */
  .extern C2FIFOINT27CLR   /* 0xBF881A24 */
  .extern C2FIFOINT27SET   /* 0xBF881A28 */
  .extern C2FIFOINT27INV   /* 0xBF881A2C */
  .extern C2FIFOUA27       /* 0xBF881A30 */
  .extern C2FIFOUA27CLR    /* 0xBF881A34 */
  .extern C2FIFOUA27SET    /* 0xBF881A38 */
  .extern C2FIFOUA27INV    /* 0xBF881A3C */
  .extern C2FIFOCI27       /* 0xBF881A40 */
  .extern C2FIFOCI27CLR    /* 0xBF881A44 */
  .extern C2FIFOCI27SET    /* 0xBF881A48 */
  .extern C2FIFOCI27INV    /* 0xBF881A4C */
  .extern C2FIFOCON28      /* 0xBF881A50 */
  .extern C2FIFOCON28CLR   /* 0xBF881A54 */
  .extern C2FIFOCON28SET   /* 0xBF881A58 */
  .extern C2FIFOCON28INV   /* 0xBF881A5C */
  .extern C2FIFOINT28      /* 0xBF881A60 */
  .extern C2FIFOINT28CLR   /* 0xBF881A64 */
  .extern C2FIFOINT28SET   /* 0xBF881A68 */
  .extern C2FIFOINT28INV   /* 0xBF881A6C */
  .extern C2FIFOUA28       /* 0xBF881A70 */
  .extern C2FIFOUA28CLR    /* 0xBF881A74 */
  .extern C2FIFOUA28SET    /* 0xBF881A78 */
  .extern C2FIFOUA28INV    /* 0xBF881A7C */
  .extern C2FIFOCI28       /* 0xBF881A80 */
  .extern C2FIFOCI28CLR    /* 0xBF881A84 */
  .extern C2FIFOCI28SET    /* 0xBF881A88 */
  .extern C2FIFOCI28INV    /* 0xBF881A8C */
  .extern C2FIFOCON29      /* 0xBF881A90 */
  .extern C2FIFOCON29CLR   /* 0xBF881A94 */
  .extern C2FIFOCON29SET   /* 0xBF881A98 */
  .extern C2FIFOCON29INV   /* 0xBF881A9C */
  .extern C2FIFOINT29      /* 0xBF881AA0 */
  .extern C2FIFOINT29CLR   /* 0xBF881AA4 */
  .extern C2FIFOINT29SET   /* 0xBF881AA8 */
  .extern C2FIFOINT29INV   /* 0xBF881AAC */
  .extern C2FIFOUA29       /* 0xBF881AB0 */
  .extern C2FIFOUA29CLR    /* 0xBF881AB4 */
  .extern C2FIFOUA29SET    /* 0xBF881AB8 */
  .extern C2FIFOUA29INV    /* 0xBF881ABC */
  .extern C2FIFOCI29       /* 0xBF881AC0 */
  .extern C2FIFOCI29CLR    /* 0xBF881AC4 */
  .extern C2FIFOCI29SET    /* 0xBF881AC8 */
  .extern C2FIFOCI29INV    /* 0xBF881ACC */
  .extern C2FIFOCON30      /* 0xBF881AD0 */
  .extern C2FIFOCON30CLR   /* 0xBF881AD4 */
  .extern C2FIFOCON30SET   /* 0xBF881AD8 */
  .extern C2FIFOCON30INV   /* 0xBF881ADC */
  .extern C2FIFOINT30      /* 0xBF881AE0 */
  .extern C2FIFOINT30CLR   /* 0xBF881AE4 */
  .extern C2FIFOINT30SET   /* 0xBF881AE8 */
  .extern C2FIFOINT30INV   /* 0xBF881AEC */
  .extern C2FIFOUA30       /* 0xBF881AF0 */
  .extern C2FIFOUA30CLR    /* 0xBF881AF4 */
  .extern C2FIFOUA30SET    /* 0xBF881AF8 */
  .extern C2FIFOUA30INV    /* 0xBF881AFC */
  .extern C2FIFOCI30       /* 0xBF881B00 */
  .extern C2FIFOCI30CLR    /* 0xBF881B04 */
  .extern C2FIFOCI30SET    /* 0xBF881B08 */
  .extern C2FIFOCI30INV    /* 0xBF881B0C */
  .extern C2FIFOCON31      /* 0xBF881B10 */
  .extern C2FIFOCON31CLR   /* 0xBF881B14 */
  .extern C2FIFOCON31SET   /* 0xBF881B18 */
  .extern C2FIFOCON31INV   /* 0xBF881B1C */
  .extern C2FIFOINT31      /* 0xBF881B20 */
  .extern C2FIFOINT31CLR   /* 0xBF881B24 */
  .extern C2FIFOINT31SET   /* 0xBF881B28 */
  .extern C2FIFOINT31INV   /* 0xBF881B2C */
  .extern C2FIFOUA31       /* 0xBF881B30 */
  .extern C2FIFOUA31CLR    /* 0xBF881B34 */
  .extern C2FIFOUA31SET    /* 0xBF881B38 */
  .extern C2FIFOUA31INV    /* 0xBF881B3C */
  .extern C2FIFOCI31       /* 0xBF881B40 */
  .extern C2FIFOCI31CLR    /* 0xBF881B44 */
  .extern C2FIFOCI31SET    /* 0xBF881B48 */
  .extern C2FIFOCI31INV    /* 0xBF881B4C */
  .extern ETHCON1          /* 0xBF882000 */
  .extern ETHCON1CLR       /* 0xBF882004 */
  .extern ETHCON1SET       /* 0xBF882008 */
  .extern ETHCON1INV       /* 0xBF88200C */
  .extern ETHCON2          /* 0xBF882010 */
  .extern ETHCON2CLR       /* 0xBF882014 */
  .extern ETHCON2SET       /* 0xBF882018 */
  .extern ETHCON2INV       /* 0xBF88201C */
  .extern ETHTXST          /* 0xBF882020 */
  .extern ETHTXSTCLR       /* 0xBF882024 */
  .extern ETHTXSTSET       /* 0xBF882028 */
  .extern ETHTXSTINV       /* 0xBF88202C */
  .extern ETHRXST          /* 0xBF882030 */
  .extern ETHRXSTCLR       /* 0xBF882034 */
  .extern ETHRXSTSET       /* 0xBF882038 */
  .extern ETHRXSTINV       /* 0xBF88203C */
  .extern ETHHT0           /* 0xBF882040 */
  .extern ETHHT0CLR        /* 0xBF882044 */
  .extern ETHHT0SET        /* 0xBF882048 */
  .extern ETHHT0INV        /* 0xBF88204C */
  .extern ETHHT1           /* 0xBF882050 */
  .extern ETHHT1CLR        /* 0xBF882054 */
  .extern ETHHT1SET        /* 0xBF882058 */
